import 'package:flutter/material.dart';

class DrawerAppBar extends StatefulWidget {
  const DrawerAppBar({
    Key? key,
  }) : super(key: key);

  @override
  State<DrawerAppBar> createState() => _DrawerAppBarState();
}

class _DrawerAppBarState extends State<DrawerAppBar> {
  final String title =
      '''Вас вітає компанія "Selina" — один із найнадійніших постачальників недорогої біжутерії в Україні.
Якщо ви бажаєте вести успішний бізнес, пов'язаний з одним із найвищих маржинальних товарів — прикрасами — то ви потрапили точно за адресою!
Ми безпосередньо імпортуємо тільки якісні прикраси з Китаю завдяки багаторічному досвіду роботи з азіатськими партнерами. Купуючи у нас, ви суттєво економите, тому що вам не доводиться утримувати армію непотрібних посередників! Ми — єдина ланка між нашим покупцем та виробником біжутерії.
Вигідна співпраця
У магазині "Selina" діє дуже приваблива система одноразових та накопичувальних знижок: чим більша сума вашої оптової покупки, тим суттєвішою ви зможете заощадити! Докладніше з цим ознайомтесь у вкладці "Оптовикам", яка знаходиться вгорі сайту. Також на вас чекає дуже приємний бонус — повністю безкоштовна доставка.
Продумана структура інтернет-магазину дозволяє вам максимально комфортно проводити вибір товарів: відкрийте будь-яку категорію, що вас цікавить, заходьте в підкатегорії, гортайте картки прикрас. Вам доступна вся потрібна інформація про актуальну ціну біжутерії, систему знижок, умови доставки та оплати!
Основа нашого величезного асортименту - тільки якісні прикраси, серед яких ви знайдете найрізноманітніші підвіски, чудові сережки,

, браслети, цікаві гумки оптом, а також обручі оптом та багато іншого!
Для того, щоб ви завжди були на два кроки перед вашими конкурентами, ми постійно оновлюємо номенклатуру наших прикрас. Як тільки виходить нова біжутерія оптом, ви можете знайти її у нас! Завдяки цьому, асортимент вашого магазину завжди поповнюватиметься найоригінальнішими зразками товарів, які точно здатні порадувати ваших покупців.
Крім іншого, на нашому сайті є блог, в якому ми ділимося з клієнтами найцікавішою і корисною інформацією зі світу біжутерії. Звідти ви дізнаєтесь, як правильно вибирати прикраси та доглядати за ними. Багато уваги приділено історії появи біжутерії у тому вигляді, який ми знаємо її зараз.
Отже, наші переваги:
- низькі ціни, безліч способів оплати;
- одноразові знижки у розмірі 5-20%;
- асортимент із тисяч прикрас;
- людяне ставлення до кожного клієнта;
- можливість співпраці з інтернет-магазинами;
- сума мінімального замовлення складає 500 грн.;
- безкоштовна доставка та багато іншого!

Надійний постачальник, з яким робота — одне задоволення, зараз є рідкістю в нашій країні. "Selina" належить саме до цього типу партнерів. До речі, незалежно від того, в якому місті України ви перебуваєте, ви зможете працювати з нами!
Якщо вам сподобалася наша біжутерія оптом, зв'язатися з нами ви можете будь-яким зручним способом: за номерами зверху сайту або електронною поштою. Також у вас є можливість залишити свій телефон для того, щоб ми вам передзвонили.
Поспішайте!''';

  @override
  Widget build(BuildContext context) {
    return Drawer(
      backgroundColor: Colors.white,
      child: Padding(
        padding: const EdgeInsets.fromLTRB(20, 80, 20, 0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            ListTile(
              title: const Text(
                'Новинки',
                style: TextStyle(fontSize: 22),
              ),
              onTap: (() {}),
            ),
            ListTile(
              title: const Text(
                'Акции',
                style: TextStyle(fontSize: 22),
              ),
              onTap: (() {}),
            ),
            ListTile(
              title: const Text(
                'Оплата и доставка',
                style: TextStyle(fontSize: 22),
              ),
              onTap: (() {}),
            ),
            ListTile(
              title: const Text(
                'Про нас',
                style: TextStyle(fontSize: 22),
              ),
              onTap: (() {
                setState(() {
                  Navigator.of(context).pop();
                  showDialog(
                    context: context,
                    builder: (context) => AlertDialog(
                      title: Text(title),
                      actions: [
                        TextButton(
                            style: TextButton.styleFrom(
                                backgroundColor: Colors.blue.shade50),
                            onPressed: () {
                              Navigator.of(context).pop();
                            },
                            child: const Text('OK')),
                      ],
                    ),
                  );
                });
              }),
            ),
            const Divider(
              height: 50,
              thickness: 1,
              color: Colors.black,
            ),
            ListTile(
              title: const Text(
                'Система скидок',
                style: TextStyle(fontSize: 22),
              ),
              onTap: (() {}),
            ),
            const Spacer(),
            const Text('+38 097 770 9957'),
            const Text('info@selina.com.ua'),
            const SizedBox(height: 20)
          ],
        ),
      ),
    );
  }
}
